Repository: ZenxIT/django_es
Catalog: django_*/documentation/src/locale/*/LC_MESSAGES/glossary.po
Languages: es

source: Glossary
es: Glosario de términos

source: field
es: campo

source: An attribute on a :term:`model`; a given field usually maps directly to a single database column.
es: Un atributo en un :term:`modelo`; el campo dado suele extrapolarse directamente a una sola columna de la base de datos.

source: See :doc:`/topics/db/models`.
es: Ve :doc:`/topics/db/models`.

source: generic view
es: vista genérica

source: A higher-order :term:`view` function that provides an abstract/generic implementation of a common idiom or pattern found in view development.
es: Una función :term:`view` de orden superior que provee una implementación abstracta/genérica a partir un modismo o patrón común encontrado en una vista de desarrollo.

source: See :doc:`/topics/class-based-views/index`.
es: Ve :doc:`/topics/class-based-views/index`.

source: model
es: modelo

source: Models store your application's data.
es: Los modelos almacenan los datos de tu aplicación.

source: "Model-template-view"; a software pattern, similar in style to MVC, but a better description of the way Django does things.
es: "Modelo-plantilla-vista"; un patrón de software, similar en estilo a MVC, pero una mejor descripción de la forma en que Django funciona.

source: See :ref:`the FAQ entry <faq-mtv>`.
es: Ve :ref:`el apunto en las FAQ <faq-mtv>`.

source: `Model-view-controller`__; a software pattern. Django :ref:`follows MVC to some extent <faq-mtv>`.
es: `Modelo-vista-controlador`__; un patrón de software. Django :ref:`sigue MVC en cierta medida <faq-mtv>`.

source: project
es: proyecto

source: A Python package -- i.e. a directory of code -- that contains all the settings for an instance of Django. This would include database configuration, Django-specific options and application-specific settings.
es: Un paquete Python -- e.g: una carpeta de código -- que contiene todos los ajustes para una instancia de Django. Esto podría incluir la configuración de la base de datos, opciones específicas de Django y ajustes específicos de las aplicaciones.

source: property
es: propiedad

source: Also known as "managed attributes", and a feature of Python since version 2.2. This is a neat way to implement attributes whose usage resembles attribute access, but whose implementation uses method calls.
es: También conocidos como "atributos gestionados" , y una funcionalidad de Python desde la versión 2.2. Esta es una forma ordenada de implementar los atributos cuyo uso se parece al acceso a los atributos, pero cuya implementación usa invocaciones a métodos.

source: See :class:`property`.
es: Ver :func:`property`.

source: An object representing some set of rows to be fetched from the database.
es: Un objeto que representa un conjunto de filas a ser extraídas de la base de datos.

source: See :doc:`/topics/db/queries`.
es: Ve :doc:`/topics/db/queries`.

source: A short label for something, containing only letters, numbers, underscores or hyphens. They're generally used in URLs. For example, in a typical blog entry URL:
es: Una etiqueta corta para algo, que solo contiene letras, números, guiones bajo o raya. Generalmente se usan en las URLs. Por ejemplo en una típica URL de publicación de un blog:

source: the last bit (``spring``) is the slug.
es: el último pedazo (``spring``) es el slug.

source: template
es: plantilla

source: A chunk of text that acts as formatting for representing data. A template helps to abstract the presentation of data from the data itself.
es: Un pedazo de texto que hace de formato para representar datos. Una plantilla ayuda a abstraerse de la representación de datos de los datos en sí.

source: See :doc:`/topics/templates`.
es: Ve :doc:`/topics/templates`.

source: view
es: vista

source: A function responsible for rendering a page.
es: Una función responsable de mostrar una página.
